{"data":{"markdownRemark":{"html":"<h3>Disclaimer</h3>\n<p>First things first, I do not claim to be an <a href=\"https://reactjs.org\">React</a>/<a href=\"https://www.gatsbyjs.org\">Gatsby</a> expert. The following content is just something I figured out by trial-and-error and would like to document / share with other <a href=\"https://reactjs.org\">React</a>/<a href=\"https://www.gatsbyjs.org\">Gatsby</a> hackers.</p>\n<h3>Problem Description</h3>\n<p>See the nice auto-hiding Navbar on this site? That took me a while to implement. Not that it's a difficult task, but it's was rediculously hard to make it perform correctly (or shall I say, elegantly) across browsers/platforms. Basically, I want it to <strong>auto-hide when you are scrolling down, and auto-reveal when you are scrolling up</strong>. Every bit of srenn real estate matters, especially in a mobile-first world.</p>\n<p>First let's get some context out of the way: I'm using bootstrap with React, so Reactstrap is the default way to go. You could either have a <em>fixed</em> navbar or a <em>non-fixed</em> one, but not an <em>auto-hiding/auto-revealing</em> one. If you ever have found yourself typing something like \"reactstrap auto hiding navbar\" into Google, you're probably in a similar situation. Fortunately, there are many hacks that sort of works available as open-source. However, since you are using React, you probably don't want to mix any jQuery stuff into your code (my take is you really shouldn't), so packages written with jQuery like <a href=\"https://www.virtuosoft.eu/code/bootstrap-autohidingnavbar/\">Bootstrap Auto-Hiding Navbar</a> are out of consideration. And unfortunately, that rules out almost all of them. </p>\n<h3>The Solution</h3>\n<p>I tested out a couple of solutions. One of them works <em>almost</em> perfectly for me, which is available at <a href=\"https://www.w3schools.com/howto/howto_js_navbar_hide_scroll.asp\">How TO - Hide Menu on Scroll - W3Schools.com</a>. If you try it out in Chrome or Firefox, it works like a charm, which concluded my first attempt to build this fancy navbar. </p>\n<p>However, if you happen to be using Safari on a Mac, problems starts to reveal. And it sucks a lot: when you scroll to the very bottom, the navbar will \"magically\" reveal itself; when you scroll back to the very top, the navbar will \"magically\" disappear. Something like the following:</p>\n<p><img src=\"/scrolling-down-hit-bottom-safari-d5de5310e1576412083de40ac0658ccb.gif\" alt=\"scrolling-down-hit-bottom-safari\"></p>","frontmatter":{"title":"Reactstrap/Gatsby Auto-hiding Navbar Trick","date":"2018-08-18"}}},"pageContext":{"slug":"/blogs/2018-08-18-reactstrap-gatsby-auto-hiding-navbar-trick/"}}